case_drifting/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Author: Chen Xiaoxiao                           |
|    \\/     M anipulation  | Website: www.smilemax.top                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0007;

boundaryField
{
    #include            "include/ABLConditions"

    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }

    ground
    {
        type            omegaWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
